Repository: Mrkhan012/flutter_EMI_manager
Catalog: lib/l10n/app_*.arb
Languages: te

source: Welcome
te: స్వాగతం

# multiple_languages_support
source: This app supports multiple languages.
te: ఈ యాప్ అనేక భాషలను మద్దతు ఇస్తుంది.

source: EMI Calculator
te: ఈఎంఐ కేల్క్యులేటర్

# preview_emi
source: Preview and calculate your EMIs.
te: మీ ఈఎంఐలను ప్రివ్యూ మరియు లెక్కించండి.

source: Profile Management
te: ప్రొఫైల్ నిర్వహణ

# save_and_view_profiles
source: Save and view your profiles.
te: మీ ప్రొఫైళ్ళను సేవ్ చేసి వీక్షించండి.

source: Skip
te: దాటవేయి

source: Done
te: పూర్తయింది

# lang
source: EMI calculator
te: ఈఎంఐ కేల్క్యులేటర్

# profile
source: Profiles
te: ప్రొఫైళ్ళు

source: Loan Amount
te: ఋణ మొత్తం

# tenure
source: Tenure (Years)
te: కాల పరిమితి (సంవత్సరాలు)

# intrest
source: Interest Rate (% P.A.)
te: వడ్డీ రేటు (% పి.ఎ)

source: Loan EMI
te: ఋణ ఈఎంఐ

# totalIntrest
source: Total Interest Payable
te: చెల్లించవలసిన మొత్తం వడ్డీ

# totalPayment
source: Total Payment (Principal + interest)
te: మొత్తం చెల్లింపు (ప్రిన్సిపల్ + వడ్డీ)

source: Save Profile
te: ప్రొఫైల్ సేవ్ చేయండి

# addProfile
source: Add Profile Name
te: ప్రొఫైల్ పేరు జోడించండి

# enterAmount
source: Enter value
te: మొత్తం నమోదు చేయండి

source: Delete profile
te: ప్రొఫైల్ తొలగించు

# enterProfile
source: Enter Profile Name
te: ప్రొఫైల్ పేరు నమోదు చేయండి

source: Cancel
te: రద్దు

source: Save
te: సేవ్

source: Delete
te: తొలగించు

source: Update
te: నవీకరణ
